import sys
if __name__ == '__main__':
    n = int(input("Введите ваш возраст: "))
    if (((n%10) == 1) & (n > 100) & ((n%5) == (n%10)) & (((n%20) != 0) & ((n%20) != 10) & ((n%20) != 12) & ((n%20) != 13) & ((n%20) != 14)) & ((n%100) != 11)):
        print("Мне", n, "год")
    elif ((n > 100) & ((n%5) == (n%10)) & (((n%20) != 0) & ((n%20) != 10) & ((n%100) != 11) & ((n%100) != 12) & ((n%100) != 13) & ((n%100) != 14))):
        print("Мне", n, "годa")
    elif (n > 100):
        print("Мне", n, "лет")
    else:
        print("Ошибка!", file=sys.stderr)
        exit(1)